tests/performance/FDOS_Test_Plan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="FDOS_Load_Test_Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <SetupThreadGroup guiclass="SetupThreadGroupGui" testclass="SetupThreadGroup" testname="setUp Thread Group">
        <intProp name="ThreadGroup.num_threads">1</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </SetupThreadGroup>
      <hashTree>
        <JDBCDataSource guiclass="TestBeanGUI" testclass="JDBCDataSource" testname="JDBC Connection Configuration">
          <boolProp name="autocommit">true</boolProp>
          <stringProp name="connectionAge">5000</stringProp>
          <stringProp name="dataSource">db_connection_pool</stringProp>
          <stringProp name="dbUrl">${__P(dos_db_url)}</stringProp>
          <stringProp name="driver">org.postgresql.Driver</stringProp>
          <boolProp name="keepAlive">true</boolProp>
          <stringProp name="password">${__P(dos_db_password)}</stringProp>
          <stringProp name="poolMax">3</stringProp>
          <boolProp name="preinit">true</boolProp>
          <stringProp name="timeout">10000</stringProp>
          <stringProp name="transactionIsolation">DEFAULT</stringProp>
          <stringProp name="trimInterval">60000</stringProp>
          <stringProp name="username">${__P(dos_db_user)}</stringProp>
        </JDBCDataSource>
        <hashTree/>
      </hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Service update feed">
        <stringProp name="ThreadGroup.num_threads">${__P(num_threads,3)}</stringProp>
        <stringProp name="ThreadGroup.ramp_time">${__P(ramp_time,1)}</stringProp>
        <stringProp name="ThreadGroup.duration">${__P(duration,3600)}</stringProp>
        <stringProp name="ThreadGroup.delay">${__P(startup_delay,0)}</stringProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <intProp name="LoopController.loops">-1</intProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config">
          <stringProp name="filename">parameter_files/dos/service_updates.csv</stringProp>
          <stringProp name="variableNames">service_type_id,update_table,row_id,update_field,update_value</stringProp>
          <boolProp name="ignoreFirstLine">true</boolProp>
          <stringProp name="delimiter">,</stringProp>
          <boolProp name="quotedData">true</boolProp>
          <boolProp name="recycle">false</boolProp>
          <boolProp name="stopThread">true</boolProp>
          <stringProp name="shareMode">shareMode.group</stringProp>
        </CSVDataSet>
        <hashTree/>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Constant Throughput Timer">
          <intProp name="calcMode">2</intProp>
          <stringProp name="throughput">${__P(dos_updates_per_minute, 10)}</stringProp>
        </ConstantThroughputTimer>
        <hashTree/>
        <SwitchController guiclass="SwitchControllerGui" testclass="SwitchController" testname="Update specific table - switch">
          <stringProp name="SwitchController.value">${update_table}</stringProp>
        </SwitchController>
        <hashTree>
          <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="services">
            <stringProp name="TestPlan.comments">Name must match the values in the switch</stringProp>
          </GenericController>
          <hashTree>
            <SwitchController guiclass="SwitchControllerGui" testclass="SwitchController" testname="Update specific field - switch">
              <stringProp name="SwitchController.value">${update_field}</stringProp>
            </SwitchController>
            <hashTree>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="publicname">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set publicname = ? where id = ?</stringProp>
                <stringProp name="queryArguments">&quot;${update_value}&quot;,${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="name" enabled="true">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set name = ? where id = ?</stringProp>
                <stringProp name="queryArguments">&quot;${update_value}&quot;,${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="address">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set address = ? where id = ?</stringProp>
                <stringProp name="queryArguments">&quot;${update_value}&quot;,${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="nonpublicphone">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set nonpublicphone = ? where id = ?</stringProp>
                <stringProp name="queryArguments">&quot;${update_value}&quot;,${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="email">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set email = ? where id = ?</stringProp>
                <stringProp name="queryArguments">&quot;${update_value}&quot;,${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="statusid" enabled="true">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set statusid = ? where id = ?</stringProp>
                <stringProp name="queryArguments">${update_value},${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">INTEGER,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="publicreferralinstructions">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set publicreferralinstructions = ? where id = ?</stringProp>
                <stringProp name="queryArguments">&quot;${update_value}&quot;,${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="typeid">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set typeid = ? where id = ?</stringProp>
                <stringProp name="queryArguments">${update_value},${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">INTEGER,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="web">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set web = ? where id = ?</stringProp>
                <stringProp name="queryArguments">&quot;${update_value}&quot;,${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
            </hashTree>
          </hashTree>
          <GenericController guiclass="LogicControllerGui" testclass="GenericController" testname="serviceendpoints" enabled="true">
            <stringProp name="TestPlan.comments">Name must match the values in the switch</stringProp>
          </GenericController>
          <hashTree>
            <SwitchController guiclass="SwitchControllerGui" testclass="SwitchController" testname="Update specific field - switch" enabled="true">
              <stringProp name="SwitchController.value">${update_field}</stringProp>
            </SwitchController>
            <hashTree>
              <JDBCSampler guiclass="TestBeanGUI" testclass="JDBCSampler" testname="address" enabled="true">
                <stringProp name="dataSource">db_connection_pool</stringProp>
                <stringProp name="query">update pathwaysdos.services set address = ? where id = ?</stringProp>
                <stringProp name="queryArguments">&quot;${update_value}&quot;,${row_id}</stringProp>
                <stringProp name="queryArgumentsTypes">VARCHAR,INTEGER</stringProp>
                <stringProp name="queryType">Prepared Update Statement</stringProp>
                <stringProp name="resultSetHandler">Store as String</stringProp>
              </JDBCSampler>
              <hashTree/>
            </hashTree>
          </hashTree>
        </hashTree>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
      <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="false">
        <boolProp name="ResultCollector.error_logging">false</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>